# Дан массив, состоящий из целых чисел. Напишите программу, которая в данном массиве определит количество элементов, 
# у которых два соседних и, при этом, оба соседних элемента меньше данного. 
# Сначала вводится число N — количество элементов 
# в массиве  Далее записаны N чисел — элементы массива. Массив состоит из целых чисел. 
# Ввод: 			Ввод:
# 5				5
# 1 2 3 4 5			1 5 1 5 1
# Вывод:			Вывод:
# 0				2
def function (list_number):
    count = 0
    for i in range(1, len(list_number) - 1):
        if list_number[i - 1] < list_number[i] > list_number [i + 1]:
            count += 1
    return count

n = int(input('Введите длину массива: '))
list_number = [ int(input('Введите значение массива: ')) for i in range(n)]

print(function(list_number))