# Дано натуральное число N и последовательность из N элементов. 
# Требуется вывести эту последовательность в обратном порядке.
# Примечание. В программе запрещается объявлять массивы и использовать циклы (даже для ввода и вывода).
# Input:    2 -> 3 4
# Output: 4 3


n = int(input())

def list_num(n):
    numbers = input()
    if n == 1:    
        return numbers    
    return list_num(n - 1) + ' ' + numbers

print(list_num(n))