# Задача 4: Петя, Катя и Сережа делают из бумаги журавликов.
# Вместе они сделали S журавликов.
# Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое количество журавликов,
# а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?
# *Пример:*
# 6 -> 1  4  1
# 24 -> 4  16  4
# 60 -> 10  40  10


sum = int(input('Сколько всего журавликов сделали дети: '))
s = c = int(sum // 6)
k = 4 * s 
while sum != 2 * s + k:
    sum = int(input('Некорректный ввод, в сумме дети не могут сделать столько журавликов по условию. Введите число журавликов :'))
    s = c = int(sum // 6)
    k = 4 * s 
  
print(f'Сережа сделал  журавликов - {s}, Петя сделал журавликов - {c} , Катя сделала журавликов - {k} ')
